/*----------------------------------------------------------------
 * 文件名：EventEnum
 * 文件功能描述：事件枚举
----------------------------------------------------------------*/

namespace Epitome.Manager
{
    /// <summary>
    /// 事件枚举
    /// </summary>
    public enum EventEnum
    {
        /// <summary>
        /// 鼠标按钮事件  主要用于多鼠标按钮识别
        /// </summary>
        MouseButtonEvent,

        //++++++++++++++++++++     连接服务器     ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
        /// <summary>
        /// 下载进度
        /// </summary>
        DownloadProgress,

    }
}


